ChampionNet(
  (fc1): Linear(in_features=922, out_features=256, bias=True)
  (bn1): BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop1): Dropout(p=0.4, inplace=False)
  (down): Linear(in_features=256, out_features=128, bias=True)
  (rb1_fc1): Linear(in_features=128, out_features=128, bias=True)
  (rb1_bn1): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (rb1_drop): Dropout(p=0.2, inplace=False)
  (rb1_fc2): Linear(in_features=128, out_features=128, bias=True)
  (rb1_bn2): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (rb2_fc1): Linear(in_features=128, out_features=128, bias=True)
  (rb2_bn1): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (rb2_drop): Dropout(p=0.2, inplace=False)
  (rb2_fc2): Linear(in_features=128, out_features=128, bias=True)
  (rb2_bn2): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (fc2): Linear(in_features=128, out_features=64, bias=True)
  (bn2): BatchNorm1d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop2): Dropout(p=0.1, inplace=False)
  (fc3): Linear(in_features=64, out_features=15, bias=True)
)